Revit 2026 API

# CompoundStructureRemoveWallSweep Method

---

Removes a single sweep or reveal from the compound structure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveWallSweep(
	WallSweepType wallSweepType,
	int id
)
```
```vb
Public Sub RemoveWallSweep (
	wallSweepType As WallSweepType,
	id As Integer
)
```
```cpp
public:
void RemoveWallSweep(
	WallSweepType wallSweepType,
	int id
)
```
```fsharp
member RemoveWallSweep :
        wallSweepType : WallSweepType *
        id : int -> unit
```

#### Parameters

wallSweepType WallSweepType
     The type of a wall sweep.
id Int32
     The id of the sweep or reveal to remove.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

No validation of input arguments is performed. If no reveal or sweep has the specified id, no action is performed.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace